test/load/actionTracker.yaml
config:
  target: "https://server-staging.api.raiinmaker.com/v1/public/graphql/"
  http:
    timeout: 300
  phases:
    - duration: 10
      arrivalRate: 150
  processor: './actionTracker.js'
  defaults:
    - headers:
      authorization: "{{ $processEnvironment.TEST_API_KEY }}"
scenarios:
  - name: 'GraphQL Query load test'
    flow:
      - function: 'testCases'
      - loop:
          - post:
              url: '/'
              # enables response logs
              afterResponse: "logging"
              json:
                query: '{{ $loopElement.query }}'
                variables: '{{ $loopElement.variables }}'
        over: cases